Revit 2026 API

# InitialIlluminanceIntensity Properties

---

The InitialIlluminanceIntensity type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Distance | The illuminance intensity distance value. |
|  | Illuminance | The illuminance intensity value. |
|  | InitialIntensityValue | The calculated initial intensity value. (Inherited from InitialIntensity) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from InitialIntensity) |

#### Reference

InitialIlluminanceIntensity Class

Autodesk.Revit.DB.Lighting Namespace